ki4igin/STM32-103STK/ADC/code/Inc/main.h

/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C"
{
#endif

  /* Includes ------------------------------------------------------------------*/

#include "stm32f1xx_ll_adc.h"
#include "stm32f1xx_ll_rcc.h"
#include "stm32f1xx_ll_bus.h"
#include "stm32f1xx_ll_system.h"
#include "stm32f1xx_ll_exti.h"
#include "stm32f1xx_ll_cortex.h"
#include "stm32f1xx_ll_utils.h"
#include "stm32f1xx_ll_pwr.h"
#include "stm32f1xx_ll_dma.h"
#include "stm32f1xx_ll_spi.h"
#include "stm32f1xx_ll_tim.h"
#include "stm32f1xx_ll_usart.h"
#include "stm32f1xx_ll_gpio.h"

#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

  /* Private includes ----------------------------------------------------------*/

  /* Exported types ------------------------------------------------------------*/

  /* Exported constants --------------------------------------------------------*/

  /* Exported macro ------------------------------------------------------------*/

  /* Exported functions prototypes ---------------------------------------------*/
  void Error_Handler(void);
  void AdcCallback(void);
  
/* Private defines -----------------------------------------------------------*/
#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0                                                                                                                                   \
  ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,                                                                                                 \
                              4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1                                                                                                                                   \
  ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,                                                                                                 \
                              3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2                                                                                                                                   \
  ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,                                                                                                 \
                              2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3                                                                                                                                   \
  ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,                                                                                                 \
                              1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4                                                                                                                                   \
  ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,                                                                                                 \
                              0 bit  for subpriority */
#endif

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
